#Student Name: Ash Hoskins, Student #S559245
#Course: CSIS 44-609 - Data Analytics Fundamentals
#Professor Denise Case
#Domain: Geospatial data
#Module 4: Task 1.

## Task 1. Create DataFrame

In [26]:
import pandas as pd

In [27]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100,87,90], 'Sam': [94,77,90], 'Katie': [100,81,82], 'Bob': [83,65,85]}
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

## Task 2. Custom Index

In [28]:
grades.index = ['Exam 1', 'Exam 2', 'Exam 3']
grades

        Wally  Eva  Sam  Katie  Bob
Exam 1     87  100   94    100   83
Exam 2     96   87   77     81   65
Exam 3     70   90   90     82   85

In [29]:
grades['Eva']

Exam 1    100
Exam 2     87
Exam 3     90
Name: Eva, dtype: int64

In [30]:
grades.Sam

Exam 1    94
Exam 2    77
Exam 3    90
Name: Sam, dtype: int64

## Task 3. Accessing Rows (loc, iloc)

In [31]:
grades.loc['Exam 1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Exam 1, dtype: int64

In [32]:
grades.iloc[0] # I prefer this method, indexing is important to know

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Exam 1, dtype: int64

In [39]:
grades.iloc[0:2] # Does this read Index row start (0), to column 2? Labels are row 0?

        Wally  Eva  Sam  Katie  Bob
Exam 1     87  100   94    100   83
Exam 2     96   87   77     81   65

## Task 3. Accessing Subsets (at, iat)

In [40]:
grades.at['Exam 2', 'Eva']

87

In [41]:
grades.iat[2,0]

70

In [42]:
grades #DF Check

        Wally  Eva  Sam  Katie  Bob
Exam 1     87  100   94    100   83
Exam 2     96   87   77     81   65
Exam 3     70   90   90     82   85

## Task 4. Describe (By Column)